---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TileHorizontalCount
source: html/04ecc760-007c-7598-94b6-29d3c6d9ae3d.htm
---
# Autodesk.Revit.DB.Visual.Tile.TileHorizontalCount Property

The property labeled "Tile Count" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TileHorizontalCount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 100".